/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_free.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sunwoo-jin <sunwoo-jin@student.42.fr>      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/06/22 15:19:29 by jihham            #+#    #+#             */
/*   Updated: 2023/07/12 12:43:30 by sunwoo-jin       ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

int	ft_free_util(void **target)
{
	if (*target)
		free(*target); //free 하고 
	*target = NULL; // 널로 바꿔주기 (다음에 접근하지 말라고)
	return (0);
}
