/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   built_in.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jihham <jihham@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/05/19 01:18:55 by jihham            #+#    #+#             */
/*   Updated: 2023/05/19 01:20:42 by jihham           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

int	is_ignore_first_arg(char *arg)
{//arg와 "--"를 비교, 만약 두 문자열이 동일하다면, 첫 번째 인수를 무시해야 하므로 1을 반환한다. 그렇지 않은 경우에는 첫 번째 인수를 무시하지 말아야 하므로 0을 반환
	if (ft_strncmp(arg, "--", 3) == 0) // --랑 arg랑 비교해서 동일할시 
		return (1); // 첫번째 인수를 무시하라고 1 리턴
	else
		return (0); // 첫번째 인수를 무시하지 말라고 0리턴
}

int	put_str(char *s, int fd)
{
	int	len;

	len = ft_strlen(s);
	write(fd, s, len);
	return (len);
}
